<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads FV2AuthPlugin dmg and imports into Munki.</string>
	<key>Identifier</key>
	<string>com.github.robperc.munki.FV2AuthPlugin</string>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.robperc-recipes.download.FV2AuthPlugin</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps</string>
		<key>NAME</key>
		<string>FV2AuthPlugin</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
			<key>Arguments</key>
			<dict>
				<key>flat_pkg_path</key>
				<string>%pathname%/*Uninstaller*.pkg</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/uninstaller-unpack</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
				<key>additional_makepkginfo_options</key>
				<array>
					<string>--uninstall_script=%RECIPE_CACHE_DIR%/uninstaller-unpack/Scripts/postinstall</string>
				</array>
				<key>pkginfo</key>
				<dict>
					<key>name</key>
					<string>%NAME%</string>
					<key>display_name</key>
					<string>File Vault 2 Authorization Plugin</string>
					<key>description</key>
					<string>Automatic FV2 User Enrollment at the Login Window.</string>
					<key>minimum_os_version</key>
					<string>10.6.0</string>
					<key>package_path</key>
					<string>FV2AuthPlugin-Installer-%version%.pkg</string>
					<key>unattended_install</key>
					<true/>
					<key>catalogs</key>
					<array>
						<string>testing</string>
					</array>
				</dict>
			</dict>
		</dict>
	</array>
</dict>
</plist>
