<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads FV2AuthPlugin dmg and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.robperc.munki.FV2AuthPlugin</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps</string>
        <key>NAME</key>
        <string>FV2AuthPlugin</string>
        <key>pkginfo</key>
        <dict>
			<key>name</key>
			<string>%NAME%</string>
			<key>description</key>
			<string>Automatic FV2 User Enrollment at the Login Window.</string>
		</dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://github.com/tburgin/FV2AuthPlugin/releases</string>
				<key>re_pattern</key>
				<string>(?P&lt;path&gt;/tburgin/FV2AuthPlugin/releases/download/[^/]*/FV2AuthPlugin-Installer-[^"]*)</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://github.com%path%</string>
				<key>filename</key>
				<string>%NAME%.dmg</string>
			</dict>
		</dict>
        <dict>
	        <key>Processor</key>
	        <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>