<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download recipe for a KyngChaos version of matplotlib. Finds and downloads a matplotlib release.
		VERSION corresponds to files at http://www.kyngchaos.com/files/software/python/matplotlib-$VERSION.dmg
		Examples include '1.1.0-1', '1.2.0-1', '1.3.1-2'
	</string>
    <key>Identifier</key>
    <string>com.github.robperc.download.matplotlib</string>
    <key>Input</key>
    <dict>
        <key>VERSION</key>
        <string>latest</string>
        <key>NAME</key>
        <string>matplotlib</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>product_name</key>
                <string>matplotlib</string>
                <key>version</key>
                <string>%VERSION%</string>
            </dict>
            <key>Processor</key>
            <string>KyngChaosURLProvider</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>