<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download recipe for QGIS. Finds and downloads a QGIS release.
		VERSION corresponds to files at http://www.kyngchaos.com/files/software/qgis/QGIS-$VERSION.dmg
		Examples include '2.6.1-1', '2.6.1-2', '2.8.1-1'
	</string>
    <key>Identifier</key>
    <string>com.github.robperc.download.QGIS</string>
    <key>Input</key>
    <dict>
        <key>VERSION</key>
        <string>latest</string>
        <key>NAME</key>
        <string>QGIS</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>DeprecationWarning</string>
            <key>Arguments</key>
            <dict>
                <key>warning_message</key>
                <string>Recipes in the robperc-recipes repository are deprecated and will soon be removed. Reply to this GitHub issue if you maintain an AutoPkg org repository and would like to take ownership of this recipe: https://github.com/autopkg/robperc-recipes/issues/13</string>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>product_name</key>
                <string>qgis</string>
                <key>version</key>
                <string>%VERSION%</string>
            </dict>
            <key>Processor</key>
            <string>com.github.autopkg.robperc.recipes.Processors/KyngChaosURLProvider</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
