<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads QGIS disk image and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.robperc.munki.QGIS</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps</string>
        <key>NAME</key>
        <string>QGIS</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>QGIS is an Open Source Geographic Information System</string>
            <key>display_name</key>
            <string>QGIS</string>
            <key>name</key>
            <string>%NAME%</string>
			<key>preinstall_script</key>
			<string>#!/bin/sh
				rm -rf /Applications/QGIS.app
			</string>
			<key>postuninstall_script</key>
			<string>#!/bin/sh
				rm -rf /Applications/QGIS.app
			</string>
			<key>requires</key>
			<array>
				<string>GDAL</string>
				<string>matplotlib</string>
				<string>numpy</string>
			</array>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.robperc.download.QGIS</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>