<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads ArchiCad LicenseManagerTool dmg and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.robperc.munki.LicenseManagerTool</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps</string>
        <key>NAME</key>
        <string>LicenseManagerTool</string>
		<key>URL</key>
		<string>http://www.graphisoft.com/downloads/licensing/help/INT/mac.html</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%URL%</string>
				<key>re_pattern</key>
				<string>(?P&lt;path&gt;http://gscdn.graphisoft.com/cdn/LMT/18/INT/License_Manager_Tool[^"]*)</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%path%</string>
				<key>filename</key>
				<string>%NAME%.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>AppDmgVersioner</string>
			<key>Arguments</key>
			<dict>
				<key>dmg_path</key>
				<string>%pathname%</string>
			</dict>
		</dict>
        <dict>
	        <key>Processor</key>
	        <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
				<key>pkginfo</key>
				<dict>
					<key>name</key>
					<string>%NAME%</string>
					<key>description</key>
					<string>The License Manager Tool is a software tool that enables you to manage GRAPHISOFT product licenses on your Protection Key.</string>
					<key>installer_type</key>
					<string>copy_from_dmg</string>
					<key>installs</key>
					<array>
						<dict>
							<key>CFBundleIdentifier</key>
							<string>com.graphisoft.GRAPHISOFT License Manager Tool</string>
							<key>CFBundleName</key>
							<string>GRAPHISOFT License Manager Tool</string>
							<key>CFBundleVersion</key>
							<string>%version%</string>
							<key>minosversion</key>
							<string>10.7.0</string>
							<key>path</key>
							<string>/Applications/GRAPHISOFT/License Manager Tool/GRAPHISOFT License Manager Tool.app</string>
							<key>type</key>
							<string>application</string>
							<key>version_comparison_key</key>
							<string>CFBundleVersion</string>
						</dict>
					</array>
					<key>items_to_copy</key>
					<array>
						<dict>
							<key>destination_path</key>
							<string>/tmp</string>
							<key>group</key>
							<string>admin</string>
							<key>mode</key>
							<string>go-w</string>
							<key>source_item</key>
							<string>GRAPHISOFT License Manager Tool Installer.app</string>
							<key>user</key>
							<string>root</string>
						</dict>
					</array>
					<key>postinstall_script</key>
					<string>#!/bin/sh

					LWPID=`ps axww | grep loginwindow | grep -v grep | awk '{print $1}'`

					JAR="/tmp/GRAPHISOFT License Manager Tool Installer.app/Contents/Resources/Java/archive.jar"

					launchctl bsexec $LWPID java -jar "$JAR" -silent

					exit $?
					</string>
					<key>requires</key>
					<array>
						<string>WkInstall</string>
						<string>CmInstall</string>
						<string>AppleJava6</string>
					</array>
					<key>uninstall_method</key>
					<string>uninstall_script</string>
					<key>uninstall_script</key>
					<string>#!/bin/sh

					LWPID=`ps axww | grep loginwindow | grep -v grep | awk '{print $1}'`

					JAR="/Applications/GRAPHISOFT/License Manager Tool/Uninstall.LMT/archive.jar"

					launchctl bsexec $LWPID java -jar "$JAR" -silent

					exit $?
					</string>
				</dict>
            </dict>
        </dict>
    </array>
</dict>
</plist>