<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads numpy .pkg and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.robperc.munki.numpy</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps</string>
        <key>NAME</key>
        <string>numpy</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>NumPy is the fundamental package for scientific computing with Python.</string>
            <key>display_name</key>
            <string>NumPy</string>
            <key>name</key>
            <string>%NAME%</string>
			<key>uninstall_method</key>
			<string>uninstall_script</string>
			<key>uninstall_script</key>
			<string>#!/bin/sh
		
				paths=( "/Library/Python/2.7/site-packages/numpy-override" "/Library/Python/2.7/site-packages/numpy-override.pth" 
					"/Library/Python/2.6/site-packages/numpy-override" "/Library/Python/2.6/site-packages/numpy-override.pth" )
				receipts=( "org.scipy.numpy-snow" "org.scipy.numpy-lion" )

				for i in ${paths[@]}; do
					rm -rf $i
				done

				for j in ${receipts[@]}; do
					pkgutil --forget $j
				done

				exit 0
			</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.robperc.download.numpy</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>